
# homevork 04
user_text = input('Введіть довільний текст або число: ')

# перевірка, що ввів користувач, слово або число
if not user_text.isdigit():

    # якщо користувач ввів слово, то рахуємо його довжину
    print('Введений текст - слово, довжиною', len(user_text), 'символів \n')

    # Якщо користувач ввів не слово, то переводимо змінну в integer
else:
    user_text = int(user_text)

    # перевіряємо на парність, за допомогою поділу за модулем
    if user_text % 2 == 0:
        print('Введений текст - число', user_text, ', воно парне')
    else:
        print('Введений текст - число', user_text, ', воно не парне \n')