
# -----------------------------Домашнє завдання 14.1

import re

# регулярний вираз, який шукає послідовність, що шукає номер телефону.
# він розділений на групи, які з'єднані між собою символом ?: на початку групи після (
# (?:\B\+)? - шукає символ "+", він може бути відсутнім
# (?:(?:\B\+)?38)? - в неї входить попередня група. Шукає код України +38
# (?:\s?|-?) - пробіл та тире, може бути присутнім, або відсутнім. Повторюється 4 рази
# (?:\(?0\d{2}\)?) - шукає три цифри, які починаються з нуля, та двух довільних
# (?:\d{3}) - шукає три цифри
# (?:\d{2}) - шукає дві цифри (повторюється 2 рази). В кінці стоїть \b що шукає границю "слова"
tel_pat = r'(?:(?:\B\+)?38)?(?:\s?|-?)(?:\(?0\d{2}\)?)(?:\s?|-?)(?:\d{3})(?:\s?|-?)(?:\d{2})(?:\s?|-?)(?:\d{2})\b'

txt = input('Введіть номер телефону: ')
t = re.fullmatch(tel_pat, txt)
print(f'Номер {t.group()} зареєстрований в Україні.' if t else f'Номер {txt} не зареєстрований в Україні.\n')

# -----------------------------Домашнє завдання 14.2

# \b([\w\d\.]{6,30})@([\w]+\.[\w]+)\b