
# -----------------------------Домашнє завдання 14.2

import re

file_name = input("Напишіть ім'я файла: ")

# в змінну text присвоємо контент файлу, якщо файла не існує - створимо його
try:
    with open(f'{file_name}.txt', 'r+') as f:
        text = f.read()
except FileNotFoundError:
    with open(f'{file_name}.txt', 'w') as f:
        print('Створено файл. Потрібен контент')
        text = ''

# Вираз \b([\w\d\.]{6,30})@([\w]+\.[\w]+)\b складається з двух груп і символом "@" між ними
# група ([\w\d\.]{6,30}) шукає послідовність з 6 - 30 літер, цифр або "."
# група ([\w]+\.[\w]+) шукає дві послідовності розділені між собою точкою
# \b шукає границю початку і кінця виразу

# скомпілюємо регулярний вираз в змінну pat
pat = re.compile(r'\b([\w\d\.]{6,30}\b)@([\w]+\.[\w]+)\b')
# замінимо e-mail послідовністю *@*
try:
    t = re.sub(pat, '*@*', text)
except Exception:
    t = 'Співпадінь не виявлено'

print(t)