import re

file_name = input("Напишіть ім'я файла: ")

# в змінну text присвоємо контент файлу, якщо файла не існує - створимо його
try:
    with open(f'{file_name}.txt', 'r+') as f:
        text = f.read()
except FileNotFoundError:
    with open(f'{file_name}.txt', 'w') as f:
        print('Створено файл. Потрібен контент')
        text = ''

# Вираз (?<=\b\w)(?:[\w\d\.]{5,29}\b)@(?:[\w]+\.[\w]+)(?=\w\b) складається з двух груп і символом "@" між ними
# попереду виразу напишем групу Lookbehind, що дозволить проігнорувати перший символ
# позаду виразу напишем групу Lookahead, що дозволить проігнорувати останній символ
# скомпілюємо регулярний вираз в змінну pat
pat = re.compile(r'(?<=\b\w)(?:[\w\d\.]{5,29}\b)@(?:[\w]+\.[\w]+)(?=\w\b)')

# замінимо символи в e-mail не змніюючи перший і останній символи
t = re.sub(pat, '*@*', text)

print(t)